# Lab 2
Take own dataset and make some analysis
## Task

In this assignment you have to:

1. Choose a data set for you own. It is better to choose a data set related to Ukraine. (source example: [data.gov.ua](https://data.gov.ua/), [data.kyivcity.gov.ua](https://data.kyivcity.gov.ua/), [kaggle.com](https://www.kaggle.com/)).
2. Create a new jupyter notebook file.
3. In the begging of the file give a short description of the data set and variables in it. It is necessary to provide a link to the sourse of the data set.
4. Read the data set. If need you should clean and transform data set.
5. Ask at least 5 question to the data set. Example of questions you could find in __Lab 1 Python__. Give answers to the questions.
6. Upload to your repository on github _.ipynb_ file and the data set (if possible).

### For task purpose I chose Selfie Injuries dataset

In [178]:
import pandas as pd

selfie_df = pd.read_csv('Selfie_Related_Injuries.csv')
selfie_df.head(128)

,Date,Country,Injuries/Casualties,Type,Description
0,15 October 2011,United States,3,Transport,Three teenagers (two sisters and a friend) wer...
1,March 2014,Spain,1,Electrocution,A 21-year-old man was electrocuted after climb...
2,March 2014,Russia,1,Transport,Two people were walking near train tracks when...
3,April 2014,United States,1,Transport,A 32-year-old woman from North Carolina was dr...
4,22 April 2014,Russia,1,Fall,A 17-year-old girl fell 30 ft to her death aft...
...,...,...,...,...,...
123,25 March 2017,United States,1,Drowned,A 14-year-old girl was standing on a log with ...
124,25 March 2017,Mexico,2,Transport,"In the city of Chínipas de Almada, Chihuahua, ..."
125,13 April 2017,India,5,Transport,Police said Taraknath Makal was travelling by ...
126,30 April 2017,Germany,1,Transport,A Scottish man was knocked down and killed aft...
127,8 May 2017,India,1,Drowned,A 21-year-old engineering student slipped from...

1. Most injuries by one accident

In [179]:
def answer_one(): 
    most = selfie_df.loc[selfie_df["Injuries/Casualties"] == selfie_df["Injuries/Casualties"].max()]
    return most["Description"].values[0]
answer_one()

'48 people were injured when standing too close to a burning bakery in Chennai, India, to take selfies. They repeatedly ignored warnings advising them to move away from the blaze.'

2. Find country that had most accidnets

In [180]:
def answer_two(): 
    return selfie_df['Country'].value_counts()[:1]
answer_two()

India    71
Name: Country, dtype: int64

3. How many transport accidents in United States?

In [181]:
def answer_three(): 
    us_df = selfie_df[selfie_df['Country'] == "United States"]
    
    return len(us_df.loc[us_df['Type'].str.contains("Transport")])
answer_three()

5

4. Find all accidents that happened after 2015 year

In [188]:
def answer_four():
    temp = selfie_df[:]
    temp["Date"] = pd.to_datetime(selfie_df['Date'])
    include = temp[temp['Date'].dt.year >= 2013]
    return include
answer_four()

,Date,Country,Injuries/Casualties,Type,Description
1,2014-03-01,Spain,1,Electrocution,A 21-year-old man was electrocuted after climb...
2,2014-03-01,Russia,1,Transport,Two people were walking near train tracks when...
3,2014-04-01,United States,1,Transport,A 32-year-old woman from North Carolina was dr...
4,2014-04-22,Russia,1,Fall,A 17-year-old girl fell 30 ft to her death aft...
5,2014-05-01,India,1,Transport,A 15-year-old boy was killed by a train while ...
...,...,...,...,...,...
187,2021-05-16,Indonesia,9,Drowned,A boat overloaded with 20 people in a reservoi...
188,2021-07-10,Hong Kong,1,Fall,32-year-old influencer Sofia Cheung died after...
189,2021-07-11,India,11,Electrocution,Eleven people died in the Indian state of Raja...
190,2021-07-28,Italy,1,Fall,A 22-year-old YouTuber from Denmark died after...
191,2021-08-06,Hungary,1,Fall,A 19-year-old Dutch citizen died after falling...

5. Find country that had most accidents in 2014 year

In [198]:
def answer_five():
    temp = selfie_df[:]
    temp["Date"] = pd.to_datetime(selfie_df['Date'])
    include_dates = temp[temp['Date'].dt.year == 2014]
    result = include_dates['Country'].value_counts()[:1]
    return result
answer_five()

Philippines    3
Name: Country, dtype: int64